cypress/fixtures/OSC/orderHistory/orderResponse.json

{
  "data": [
    {
      "id": 1323,
      "attributes": {
        "order_id": "d9cb9db1c1060aa777add684137b3f89da97d888568f0d5c2a9485ea0947041a",
        "bpp_id": "bpp-ps-network-vendure-dev.becknprotocol.io",
        "bpp_uri": "https://bpp-ps-network-vendure-dev.becknprotocol.io",
        "currency": "INR",
        "delivery_status": null,
        "descriptor": {
          "name": "Benoît Castel",
          "short_desc": ""
        },
        "price": 4.37,
        "billing": null,
        "fulfillments": null,
        "created_date": null,
        "last_updated_date": null,
        "quote": {
          "price": {
            "value": "4.37",
            "currency": "INR"
          },
          "breakup": [
            {
              "price": {
                "value": "3.70",
                "currency": "INR"
              },
              "title": "base-price"
            },
            {
              "price": {
                "value": "0.00",
                "currency": "INR"
              },
              "title": "shipping"
            },
            {
              "price": {
                "value": "0.67",
                "currency": "INR"
              },
              "title": "taxes"
            }
          ]
        },
        "transaction_id": "d2e56e49-9c55-4239-950f-81233c395cab",
        "message_id": null,
        "payments": [
          {
            "id": "7",
            "name": "Standard",
            "time": {
              "label": "Transaction timestamp",
              "timestamp": "2024-05-23T10:22:53.577Z"
            },
            "type": "PRE-FULFILLMENT",
            "params": {
              "amount": "4.37",
              "currency": "INR",
              "transaction_id": ""
            },
            "status": "PAID"
          }
        ],
        "items": [
          {
            "id": "72",
            "name": "Chocolate Cake",
            "tags": [
              {
                "code": "facets",
                "list": [
                  {
                    "code": "patisserie",
                    "name": "Patisserie",
                    "value": "Y"
                  },
                  {
                    "code": "pastry",
                    "name": "Pastry",
                    "value": "Y"
                  },
                  {
                    "code": "cake",
                    "name": "Cake",
                    "value": "Y"
                  },
                  {
                    "code": "chocolate",
                    "name": "Chocolate",
                    "value": "Y"
                  }
                ],
                "name": "Facets",
                "display": true
              }
            ],
            "price": {
              "value": "3.70",
              "currency": "INR",
              "listed_value": "3.70"
            },
            "images": [
              {
                "url": "http://bpp-unified-vendure-dev.becknprotocol.io/assets/source/13/377__02.jpeg"
              }
            ],
            "quantity": {
              "selected": {
                "count": 1
              }
            },
            "long_desc": "Careful preparation based on eggs, butter, sugar and enhanced by the exoticism of Guayaquil chocolate. <div>\r\n    <p>Main Ingredients: eggs, butter, sugar, Guayaquil chocolate</p>\r\n    <p>Allergens: Contains dairy</p>\r\n    <p>Size: Serves 1</p>\r\n</div>"
          }
        ],
        "createdAt": "2024-05-23T10:22:59.204Z",
        "updatedAt": "2024-05-23T10:22:59.204Z",
        "publishedAt": "2024-05-23T10:22:59.195Z",
        "domain": null
      }
    },
    {
      "id": 1389,
      "attributes": {
        "order_id": "d4802838705148c9681aa0cc3d14ead7564cbb7f3ad7eb76d32c1a3f1dde03e1",
        "bpp_id": "bpp-ps-network-vendure-dev.becknprotocol.io",
        "bpp_uri": "https://bpp-ps-network-vendure-dev.becknprotocol.io",
        "currency": "EUR",
        "delivery_status": null,
        "descriptor": {
          "name": "Benoît Castel",
          "short_desc": ""
        },
        "price": 4.37,
        "billing": null,
        "fulfillments": null,
        "created_date": null,
        "last_updated_date": null,
        "quote": {
          "price": {
            "value": "4.37",
            "currency": "EUR"
          },
          "breakup": [
            {
              "price": {
                "value": "3.70",
                "currency": "EUR"
              },
              "title": "base-price"
            },
            {
              "price": {
                "value": "0.00",
                "currency": "EUR"
              },
              "title": "shipping"
            },
            {
              "price": {
                "value": "0.67",
                "currency": "EUR"
              },
              "title": "taxes"
            }
          ]
        },
        "transaction_id": "91f6c3e0-0cb4-420b-9276-e53364be2d93",
        "message_id": null,
        "payments": [
          {
            "id": "7",
            "name": "Standard",
            "time": {
              "label": "Transaction timestamp",
              "timestamp": "2024-05-31T12:33:00.822Z"
            },
            "type": "PRE-FULFILLMENT",
            "params": {
              "amount": "4.37",
              "currency": "EUR",
              "transaction_id": ""
            },
            "status": "PAID"
          }
        ],
        "items": [
          {
            "id": "72",
            "name": "Chocolate Cake",
            "tags": [
              {
                "code": "facets",
                "list": [
                  {
                    "code": "patisserie",
                    "name": "Patisserie",
                    "value": "Y"
                  },
                  {
                    "code": "pastry",
                    "name": "Pastry",
                    "value": "Y"
                  },
                  {
                    "code": "cake",
                    "name": "Cake",
                    "value": "Y"
                  },
                  {
                    "code": "chocolate",
                    "name": "Chocolate",
                    "value": "Y"
                  }
                ],
                "name": "Facets",
                "display": true
              }
            ],
            "price": {
              "value": "3.70",
              "currency": "EUR",
              "listed_value": "3.70"
            },
            "images": [
              {
                "url": "http://bpp-unified-vendure-dev.becknprotocol.io/assets/source/13/377__02.jpeg"
              }
            ],
            "quantity": {
              "selected": {
                "count": 1
              }
            },
            "long_desc": "Careful preparation based on eggs, butter, sugar and enhanced by the exoticism of Guayaquil chocolate. <div>\r\n    <p>Main Ingredients: eggs, butter, sugar, Guayaquil chocolate</p>\r\n    <p>Allergens: Contains dairy</p>\r\n    <p>Size: Serves 1</p>\r\n</div>"
          }
        ],
        "createdAt": "2024-05-31T12:33:05.929Z",
        "updatedAt": "2024-05-31T12:33:05.929Z",
        "publishedAt": "2024-05-31T12:33:05.923Z",
        "domain": null
      }
    },
    {
      "id": 1762,
      "attributes": {
        "order_id": "829d2584-b281-45e2-9d9c-e965fd963617",
        "bpp_id": "bpp123",
        "bpp_uri": "https://bpp.example.com",
        "currency": "INR",
        "delivery_status": null,
        "descriptor": {
          "name": "Provider One",
          "short_desc": ""
        },
        "price": 2160,
        "billing": null,
        "fulfillments": null,
        "created_date": null,
        "last_updated_date": null,
        "quote": {
          "price": {
            "value": "2160.00",
            "currency": "INR"
          },
          "breakup": [
            {
              "price": {
                "value": "100.00",
                "currency": "INR"
              },
              "title": "base-price"
            },
            {
              "price": {
                "value": "200.00",
                "currency": "INR"
              },
              "title": "base-price"
            },
            {
              "price": {
                "value": "360.00",
                "currency": "INR"
              },
              "title": "taxes"
            }
          ]
        },
        "transaction_id": "12345",
        "message_id": null,
        "payments": [
          {
            "id": "8",
            "name": "Standard",
            "type": "PRE-FULFILLMENT",
            "params": {
              "amount": "2160.00",
              "currency": "INR"
            },
            "status": "NOT-PAID"
          }
        ],
        "items": [
          {
            "id": "item1",
            "name": "Cake One",
            "price": {
              "value": "100.00",
              "currency": "INR",
              "listed_value": "100.00"
            },
            "images": [
              {
                "url": "http://bpp-unified-vendure-staging.becknprotocol.io/assets/preview/8f/377__preview.jpeg"
              }
            ],
            "quantity": {
              "selected": {
                "count": 1
              }
            },
            "long_desc": "Protect you from sun rays and wind Polarised- Polarising lens: reduces reflections from bright surfaces Sun Protection- Category 3 lens - 100% UV filter: perfect for sunny weather."
          },
          {
            "id": "item2",
            "name": "Cake Two",
            "price": {
              "value": "200.00",
              "currency": "INR",
              "listed_value": "200.00"
            },
            "images": [
              {
                "url": "http://bpp-unified-vendure-staging.becknprotocol.io/assets/preview/8f/377__preview.jpeg"
              }
            ],
            "quantity": {
              "selected": {
                "count": 1
              }
            },
            "long_desc": "Careful preparation based on eggs, butter, sugar and enhanced by the exoticism of Guayaquil chocolate."
          }
        ],
        "createdAt": "2024-08-22T05:07:25.228Z",
        "updatedAt": "2024-08-22T05:07:25.228Z",
        "publishedAt": "2024-08-22T05:07:25.219Z",
        "domain": null
      }
    }
  ],
  "meta": {
    "pagination": {
      "page": 1,
      "pageSize": 25,
      "pageCount": 1,
      "total": 4
    }
  }
}
